Revit 2027 API
Camera.UpDirection Property
 Up direction of the camera
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ UpDirection { get; set; }
Public Property UpDirection As XYZ
	Get
	Set
public:
property XYZ^ UpDirection {
	XYZ^ get ();
	void set (XYZ^ value);
}
member UpDirection : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace